<%@ Page Title="" Language="C#" MasterPageFile="~/Main.Master" AutoEventWireup="true" CodeBehind="main.aspx.cs" Inherits="mpSite.WebForm1" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
    <link href="css/index.css" rel="stylesheet" />
    <script src="js/index.js"></script>
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    <ul class="animals">
        <li><a href="#lion" onclick="highlightInfo(this)">אריה</a></li>
        <li><a href="#elephant">פיל</a></li>
        <li><a href="#orangotan">אורנגאוטן</a></li>
        <li><a href="#giraffe">ג'ירף</a></li>
        <li><a href="#wolf">זאב</a></li>
        <li><a href="#ant_bear">דוב נמלים</a></li>
        <li><a href="#panda">פנדה ענקית</a></li>
    </ul>


    <div class="info">
        <h2 id="lion">אריה</h2>
        <h3>
            האריה נפוץ בעיקר ביבשת אפריקה, אך גם במדינת גוג'ראט שבהודו. הוא ניזון מאוכלי עשב שונים אותם הוא צד, וכן מפגרים. בתרבות האנושית נחשב האריה סמל לגבורה וכוח, ולכן הוצמד לו הכינוי "מלך החיות". תוחלת חייו בטבע היא בין 12 ל-18 שנים, אך בשבי הוא יכול לחיות עד 30 שנה. שמות נוספים של האריה בשפה העברית הם ליש, שחל, שחץ ולביא. שם נקבת האריה הוא לביאה וגור האריות נקרא כפיר.
        </h3>
        <a class="readmore" href="https://he.wikipedia.org/wiki/אריה">לעוד מידע</a>
    </div>

    <div style="float:left;" class="info">
        <h2 id="elephant">פיל</h2>
        <h3>
            פיל הוא מונח לקבוצה פוליפילטית של שלושה מיני יונקים – פיל סוואנה אפריקני, פיל יער אפריקני ופיל אסייתי – שהם חיות היבשה הגדולות ביותר בעולם והמינים היחידים ששרדו במשפחת הפיליים. בעבר היו מינים נוספים מהמשפחה, ביניהם הממותה, הפלאולוקסודון והסטגוטטרבלודון שאינם נחשבים לפילים רגילים.
        </h3>
    </div>

    <div style="float:left;" class="info">
        <h2 id="giraffe">גירפה</h2>
        <h3>
            לג'ירף רגליים וצוואר ארוכים מאוד. גובה כתפיו כ-3 מטרים מעל הקרקע וגובה ראשו כ־5.3 מטר מעל פני הקרקע. צבעו חום-צהוב עם כתמים כהים וגדולים. צבע זה משמש לו בתור הסוואה מאויביו. ראיית הג'ירף חדה, והוא מיטיב לרוץ ולהימלט מאויביו במהירות של עד 60–65 קמ"ש. במצחו בין שתיים לחמש קרניים. בכל רגל של הג'ירף קיים זוג אצבעות אחד בלבד. כמו אצל כמעט כל היונקים, גם לג'ירף יש שבע חוליות צוואר, רק שבמהלך האבולוציה הן התארכו מאוד.
        </h3>
    </div>
    <div class="info">
        <h2 id="orangotan">אורנגאוטן</h2>
        <h3>
            הוא סוג של קוף-אדם אינטליגנטי ואקרובטי המאופיין בזרועות ארוכות ובשיער חום-אדמדם. כיום הוא מצוי אך ורק ביערות הגשם של האיים בורנאו וסומטרה (במדינות אינדונזיה ומלזיה), אולם שרידי מאובנים שנמצאו בג'אווה, בווייטנאם ובסין מעידים שבעבר תחום תפוצתו היה נרחב יותר, וכלל שטחים רחבים במזרח אסיה.
        </h3>
    </div>
    <div style="float:left;" class="info">
        <h2 id="wolf">זאב מצוי</h2>
        <h3>
            הוא מין טורף בסוג כלב שבסדרת הטורפים, אבי כלב הבית. זהו בעל החיים הגדול ביותר במשפחת הכלביים.הזאבים בעלי תפוצה גאוגרפית רחבה ביותר ברחבי האזור ההולארקטי, לאורך אמריקה הצפונית ואירואסיה. הם חיים בלהקות הנודדות יחד בחיפושם אחרי טרף. הזאב המצוי הוא מין אנדמי לאזור דרום סין. בנוסף הוא גם מין אנדמי לאזורים של צפון אמריקה.
        </h3>
    </div>
    <div class="info">
        <h2 id="ant_bear">דוב נמלים</h2>
        <h3>
            היא תת-סדרה של יונקים בעל-סדרת הדלשינאים, הם טורפים שחבריה ידועים בשל התאמתם לאכילת נמלים וטרמיטים. הם בעלי חרטומים ארוכים דמויי צינור והם חסרי שיניים.
        </h3>
    </div>
    <div class="info">
        <h2 id="panda">פנדה ענקית</h2>
        <h3>
            היא מין של יונק והמין היחיד ששרד בסוג פנדה, המסווג במשפחת הדוביים (Ursidae) והשוכן במרכז סין. הפנדה חיה באזורים הרריים, כגון סצ'ואן וטיבט. לקראת סוף המאה ה-19 הפכה הפנדה ל"סמל לאומי" בסין ודמותה מופיעה על מטבעות זהב סיניים.
        </h3>
    </div>
    <div style="float:left;" class="info">
        <h2 id="cheetah">צ'יטה</h2>
        <h3>
            הוא מין בסוג ברדלס שבמשפחת החתוליים. בנוסף אליו יש שני מינים שעדיין קיימים: ברדלס מלכותי וברדלס אסייתי שכיום חי רק באיראן. היה גם ברדלס אמריקאי שניכחד.בריצתו הוא מסוגל להגיע למהירות מרבית של 100 קמ"ש. בעבר היה נהוג לחשוב שברדלס מגיע למהירויות של 110-120 קמ"ש, אך נתון זה התברר כשגוי. עם זאת, הוא עדיין נחשב לבעל החיים היבשתי המהיר ביותר. בדילוגים, יכול הברדלס להגיע עד למרחק של שמונה מטרים.
        </h3>
    </div>
</asp:Content>
